A = [["a","あ"],
    ["i","い"],
    ["u","う"],
    ["e","え"],
    ["o","お"]]
K = [ ["ka","か"],
    ["ki","き"],
    ["ku","く"],
    ["ke","け"],
    ["ko","こ"]]
S = [
    ["sa","さ"],
    ["shi","し"],
    ["su","す"],
    ["se","せ"],
    ["so","そ"]]
T = [
    ["ta","た"],
    ["chi","ち"],
    ["tsu","つ"],
    ["te","て"],
    ["to","と"] ]

N = [
    ["na","な"],
    ["ni","に"],
    ["nu","ぬ"],
    ["ne","ね"],
    ["no","の"]]
H = [
    ["ha","は"],
    ["hi","ひ"],
    ["hu","ふ"],
    ["he","へ"],
    ["ho","ほ"]]
M = [
    ["ma","ま"],
    ["mi","み"],
    ["mu","む"],
    ["me","め"],
    ["mo","も"]]
R = [
    ["ra","ら"],
    ["ri","り"],
    ["ru","る"],
    ["re","れ"],
    ["ro","ろ"] ]
Y = [
    ["ya","や"],
    ["yu","ゆ"],
    ["yo","よ"] ]
W = [
    ["wa","わ"],
    ["wo","を"],
    ["n","ん"]]

corpus =     A + K + S + T + N + H + M + R
fullcorpus = A + K + S + T + N + H + M + R + Y + W
new_corp = fullcorpus
#new_corp = Y + W + R + A
#new_corp = A + N + H + M + T
# new_corp = Y + W
