A = [
["a","ア"],
["i","イ"],
["u","ウ"],
["e","エ"],
["o","オ"]]

K = [
["ka","カ"],
["ki","キ"],
["ku","ク"],
["ke","ケ"],
["ko","コ"]]

S = [
["sa","サ"],
["shi","シ"],
["su","ス"],
["se","セ"],
["so","ソ"]]

T = [
["ta","タ"],
["chi","チ"],
["tsu","ツ"],
["te","テ"],
["to","ト"]]

N = [
["na","ナ"],
["ni","ニ"],
["nu","ヌ"],
["ne","ネ"],
["no","ノ"]]

H = [
["ha","ハ"],
["hi","ヒ"],
["fu","フ"],
["he","ヘ"],
["ho","ホ"]]
M = [
["ma","マ"],
["mi","ミ"],
["mu","ム"],
["me","メ"],
["mo","モ"]]

Y = [
["ya","ヤ" ],
["yu","ユ" ],
["n" ,"ヨ" ],
]

R = [
["ra","ラ"],
["ri","リ"],
["ru","ル"],
["re", "レ"],
["ro","ロ"]
]

W = [
["wa","ワ"],
["wo","ヲ"],
["nn","ン"] ]

G = [["ga","ガ"],
     ["gi","ギ"],
     ["gu","グ"],
     ["ge","ゲ"],
     ["go","ゴ"]]

B = [["ba","バ"],
     ["bi","ビ"],
     ["bu","ブ"],
     ["be","ベ"],
     ["bo","ボ"]]

P = [["pa","パ"],
     ["pi","ピ"],
     ["pu","プ"],
     ["pe","ペ"],
     ["po","ポ"]]

Z = [["za","ザ"],
     ["zi","ゼ"],
     ["zu","ズ"],
     ["ze","ジ"],
     ["zo","ゾ"]]

        
D = [["da","ダ"],
["di","ヂ"],
["du","ヅ"],
["de","デ"],
["do","ド"] ]


mapping = {
        'A':A, 'K':K, 'S':S, 'T':T, 'N':N, 'H':H,
        'M':M, 'R':R, 'Y':Y, 'W':W, 'Z':Z, 'D':D,
        #'M':M, 'R':R, 'Y':Y, 'W':W, 'Z':Z, 'D':D,
        'B':B, 'P':P
        }
def getAggregateList(symb):
    agg = []
    for char in symb:
        agg += mapping[char]
    return agg
